[{
  "url": "https://community.sourcegraph.com/t/how-to-change-account-login-method/2498",
  "title": "Changing account login method from Google to Sourcegraph",
  "answer": "To switch your login method from Google to Sourcegraph, use the Sourcegraph Enterprise login option despite being a Pro user. After logging out, select the Enterprise option, enter https://sourcegraph.com as the URL and use your access token. This method works for cloud customers who need custom URLs and for Sourcegraph Gateway instances."
},
{
  "url": "https://community.sourcegraph.com/t/updating-cody-search-index-hangs-forever/2275",
  "title": "Troubleshooting stalled Cody search index updates",
  "answer": "If you encounter a situation where the 'Updating Cody search index...' process appears to hang indefinitely, it may not be directly related to Cody itself. One potential cause could be related to extension dependencies. In one user's experience, deactivating the Python extension led to this issue, and reactivating it resolved the problem. Therefore, it's advisable to check your extensions and ensure they are properly enabled."
},
{
  "url": "https://community.sourcegraph.com/t/claude-3-7-sonnet-does-not-show-in-model-list-es-plan/2259",
  "title": "Availability of Claude 3.7 Sonnet model for Enterprise Starter plan users",
  "answer": "The Claude 3.7 Sonnet model, currently available on the Pro plan, is scheduled for a phased rollout to Enterprise Starter users. Our team is actively working to make this model accessible to all Enterprise Starter subscribers."
},
{
  "url": "https://community.sourcegraph.com/t/security-question/2115",
  "title": "Security considerations when using custom API keys and model configurations",
  "answer": "When utilizing your own API key and model configuration with Cody and `cody.dev.models`, the requests are primarily routed directly to your designated provider. While some background processing may occur to gather context and transmit telemetry data, the core prompt and request are designed to be sent to your deployment. This architecture aims to ensure that sensitive data remains within your control, minimizing exposure to external systems."
},
{
  "url": "https://community.sourcegraph.com/t/failed-to-retrieve-search-context-evalerror-symf-failed/2667",
  "title": "Resolving 'symf failed' error in VS Code",
  "answer": "If you encounter the error 'Failed to retrieve search context: EvalError: symf failed' in VS Code, try deleting your chat history. This can sometimes resolve the issue without needing to restart the IDE. This error may occur on new chats until the history is cleared."
},
{
  "url": "https://community.sourcegraph.com/t/vscode-extension-not-working-in-ssh-remote-connection/1834",
  "title": "Troubleshooting Sourcegraph VS Code extension in SSH remote connections",
  "answer": "For users experiencing issues with the Sourcegraph VS Code extension within an SSH remote connection, a potential workaround involves manually modifying the `package.json` file of the `sourcegraph.sourcegraph` extension. Specifically, by setting the `\"extensionKind\"` property to `[ \"ui\" ]` and then reinstalling the extension, users have reported successful functionality of Sourcegraph code search within remote workspaces, utilizing local settings."
},
{
  "url": "https://community.sourcegraph.com/t/hitting-limits-due-to-model-switching/2200",
  "title": "Resolving rate limit issues caused by model switching",
  "answer": "If you encounter rate limit issues due to frequent model switching, update your Cody plugin/extension to the latest stable version. Then, log out and log back into your Sourcegraph account to resolve the issue. This solution addresses problems related to what Sourcegraph identified as 'problematic code' that caused some users to be incorrectly flagged or banned."
},
{
  "title": "Error: 403 workspaces forbidden user is banned",
  "answer": "Please contact support@sourcegraph.com via e-mail for further clarification."
},
{
  "url": "https://community.sourcegraph.com/t/change-the-plan/2315",
  "title": "Changing your Sourcegraph subscription plan",
  "answer": "To modify your current Sourcegraph subscription plan, the most efficient method is to cancel your existing subscription and then resubscribe with the desired plan. This ensures a seamless transition and accurate billing for your chosen services."
},
{
  "url": "https://community.sourcegraph.com/t/extremely-laggy-in-vscode/1792",
  "title": "Extremely laggy in VS Code",
  "answer": "If you're experiencing significant lag when using Sourcegraph within VS Code, a potential solution is to clear your chat history. Within the chat history tab, you'll find a trash bin icon labeled 'Delete All,' which allows you to remove the entire chat log. This can sometimes resolve performance bottlenecks."
},
{
  "url": "https://community.sourcegraph.com/t/received-no-parseable-response-data-from-anthropic/2396",
  "title": "Received no parseable response data from Anthropic",
  "answer": "Anthropic servers occasionally experience downtime that can cause this error. When you encounter 'Received no parseable response data from Anthropic', check the Anthropic Status page for service disruptions. Restarting your IDE typically won't resolve this issue if it's related to server availability."
},
{
  "url": "https://community.sourcegraph.com/t/cody-edit-history/2466",
  "title": "Cody edit history feature appearing in git commit tab",
  "answer": "The edit history display appearing in the git commit tab is an experimental feature that was accidentally included in the Cody release. This is a prototype feature not intended for general release yet. Users should ignore it until a fix is deployed. The issue only appears in certain projects and may cause performance slowdowns in VS Code."
},
{
  "url": "https://community.sourcegraph.com/t/classical-status-429/2475",
  "title": "Troubleshooting 429 error in Cody Pro",
  "answer": "If you encounter a '429 error' indicating you've exceeded the concurrency limit for chat completions, try logging out and logging back in to your IDE and web interface. This often resolves the issue by resetting your session. If the problem persists, please contact support@sourcegraph.com"
},
{
  "url": "https://community.sourcegraph.com/t/unable-to-authenticate-cody-in-wsl2-not-logged-in-error/2469",
  "title": "Issue Authenticating Cody in WSL2 environment",
  "answer": "For WSL2 users experiencing 'Not logged in' messages with Cody, it could be that you need additional steps to configure your WSL DNS namespace. Especially deactivating IPv6 for the WSL connection."
},
{
  "url": "https://community.sourcegraph.com/t/add-private-github-repos-to-enterprise-starter/2459",
  "title": "Adding private GitHub repos from multiple accounts to Enterprise Starter",
  "answer": "When linking private GitHub repositories from multiple accounts to your Enterprise Starter instance, check that all repositories are visible in the repository manager and that you've configured it to use all repositories instead of selected ones. If you're still having issues, verify that all GitHub accounts use the same registered email address, as differences can prevent successful repository linking."
},
{
  "url": "https://community.sourcegraph.com/t/commit-generate-error-failed-to-get-git-output/2482",
  "title": "Understanding commit message generation errors in multi-workspace projects",
  "answer": "The 'Failed to get git output' error when using Cody's commit message generation feature typically occurs in multi-workspace folder setups. Currently, Cody's commit message generation functionality only works in single-workspace, single-repository projects."
},
{
  "url": "https://github.com/sourcegraph/jetbrains/issues/3225",
  "title": "GoLand on macOS repeatedly prompts for Cody login despite successful authentication.",
  "answer": "To resolve this, please ensure that GoLand is configured to use the native macOS Keychain for storing passwords. This allows the application to securely remember your login credentials. To check this setting, navigate to **Settings** (or **Preferences** on macOS) > **Appearance & Behavior** > **System Settings** > **Passwords** and verify that the option **'In native Keychain'** is selected. If it's not, select it and restart GoLand."
},
{
  "url": "https://www.reddit.com/r/sourcegraph/comments/1jr9tzh/stuck_at_starting_cody_in_phpstorm/",
  "title": "As the Title says I'm stuck at \"Starting Cody...\" in PhpStorm.",
  "answer": "To resolve the \"Starting Cody...\" hang in PhpStorm on Ubuntu 24.04, try these additional troubleshooting steps: Verify JCEF (Java Chromium Embedded Framework) is properly enabled with correct VM options, ensure all required system packages are installed (libnss3, libatk-bridge2.0-0t64, libxss1, libgbm1, libasound2t64), and check your IDE logs for specific errors. If problems persist, try resetting the IDE cache or reinstalling the Cody plugin."
},
{
  "url": "https://community.sourcegraph.com/t/is-there-a-status-board-for-cody/2537",
  "title": "Is there a status board for Cody?",
  "answer": "Yes, Sourcegraph maintains a status page for monitoring Cody and other services. You can check the status page at 'Sourcegraph Status' which shows maintenance events and service availability. During outages, Sourcegraph also posts announcements about scheduled maintenance that may affect service here: https://sourcegraphstatus.com/"
},
{
  "url": "https://community.sourcegraph.com/t/how-to-ignore-files-folders/2622",
  "title": "How to ignore files/folders in Cody",
  "answer": "Currently, Cody does not have a built-in file/folder ignore feature for JetBrains IDEs. While the documentation mentions an ignore feature for Enterprise users, this is not available for Pro users at this time. The feature has been requested and tagged for the product team's consideration. Pro users seeking similar functionality should monitor future updates as this has been identified as a desired feature."
},
{
  "url": "https://community.sourcegraph.com/t/how-to-customize-cody/2651",
  "title": "How to customize Cody in Visual Studio",
  "answer": "For customizing Cody in Visual Studio, use 'cody.chat.preInstruction' instead of 'instructions' in your configuration file. The Visual Studio extension is still in experimental phase, so some features may not work as expected. When configuring Cody, ensure you're using the correct configuration keys as they differ between IDE extensions."
},
{
  "url": "https://www.reddit.com/r/sourcegraph/comments/1khiig3/how_to_deal_with_login_error_failed_to_saving/",
  "title": "How to deal with login error 'Failed to saving state to session'",
  "answer": "This error is typically due to a service interruption or network issue on our end. Please check the status page https://sourcegraphstatus.com/ for any updates or outages."
}]